import img1 from '../../resources/img/products/aylMas.webp'
import img2 from '../../resources/img/products/benziniTrimerFilter.webp'
import img4 from '../../resources/img/products/drujba.webp'
import img3 from '../../resources/img/products/drelimasAcux.webp'
import img5 from '../../resources/img/products/electro1.jpeg'
import img6 from '../../resources/img/products/eximInchKencaxain.webp'
import img7 from '../../resources/img/products/gorciqnerAyl.webp'
import img8 from '../../resources/img/products/knopkaDrel.webp'
import img9 from '../../resources/img/products/kovKtich.webp'
import img10 from '../../resources/img/products/paytain.jpg'
import img11 from '../../resources/img/products/pcheliq.webp'
import img12 from '../../resources/img/products/qariStanok.jpg'
import img13 from '../../resources/img/products/roxlya.jpg'
import img14 from '../../resources/img/products/srskich.webp'
import img15 from '../../resources/img/products/svarka.jpg'
import img16 from '../../resources/img/products/traktoriFilter.webp'
import img17 from '../../resources/img/products/vakum.jpg'
import img18 from '../../resources/img/products/xotHndzich.webp'
import img19 from '../../resources/img/products/motoblok.webp'
import img20 from '../../resources/img/products/prpur.webp'
import img21 from '../../resources/img/products/generator.webp'
import shopAdvertisementSliderImage1 from '../img/shopAdvertisementSlider/1.webp'
import shopAdvertisementSliderImage2 from '../img/shopAdvertisementSlider/2.webp'
import shopAdvertisementSliderImage3 from '../img/shopAdvertisementSlider/3.webp'
import shopAdvertisementSliderImage4 from '../img/shopAdvertisementSlider/4.webp'


const data = () => {
    const data = {
        languages: {
            rus: {
                languages: '/рус/',
                menu: [
                    {
                        categorie: 'ГЛАВНАЯ',
                        url: '/рус/',
                        submenu: []
                    },
                    {
                        categorie: 'НОВЫЕ',
                        url: '/рус/новые',
                        submenu: []
                    },
                    {
                        categorie: 'РАСПРОДАЖА',
                        url: '/рус/распродажа/',
                        submenu: []
                    },
                    {
                        categorie: 'ИНСТРУМЕНТЫ',
                        url: '/рус/инструменты/',
                        submenu: [
                            {
                                categorie: 'Электроинструменты',
                                url: '/рус/инструменты/электроинструменты/'
                            },
                            {
                                categorie: 'Сварочныйе Аппараты',
                                url: '/рус/инструменты/сварочныйе-аппараты/'
                            },
                            {
                                categorie: 'Деревообрабатывающие Станки',
                                url: '/рус/инструменты/деревообрабатывающие-станки/'
                            },
                            {
                                categorie: 'Пневматические Инструменты',
                                url: '/рус/инструменты/пневматические-инструменты/'
                            },
                            {
                                categorie: 'Камнеобрабатывающие Станки',
                                url: '/рус/инструменты/камнеобрабатывающие-станки/'
                            },
                            {
                                categorie: 'Другое',
                                url: '/рус/инструменты/другое/'
                            }
                        ]
                    },
                    {
                        categorie: 'СЕЛЬСКОХОЗЯЙСТВЕННЫЕ ИНСТРУМЕНТЫ',
                        url: '/рус/сельскохозяйственные-инструменты/',
                        submenu: [
                            {
                                categorie: 'Мотоблоки',
                                url: '/рус/сельскохозяйственные-инструменты/мотоблоки/'
                            },
                            {
                                categorie: 'Доильныеаппараты',
                                url: '/рус/сельскохозяйственные-инструменты/доильныеаппараты/'
                            }, {
                                categorie: 'Триммеры',
                                url: '/рус/сельскохозяйственные-инструменты/триммеры/'
                            },
                            {
                                categorie: 'Бензопилы',
                                url: '/рус/сельскохозяйственные-инструменты/бензопилы/'
                            },
                            {
                                categorie: 'Опрыскиватели',
                                url: '/рус/сельскохозяйственные-инструменты/опрыскиватели/'
                            },
                            {
                                categorie: 'Другое',
                                url: '/рус/сельскохозяйственные-инструменты/другое/'
                            }
                        ]
                    },
                    {
                        categorie: 'АКСЕССУАРЫ',
                        url: '/рус/аксессуары/',
                        submenu: [
                            {
                                categorie: 'Инструменты',
                                url: '/рус/аксессуары/инструменты/'
                            },
                            {
                                categorie: 'Электроинструменты',
                                url: '/рус/аксессуары/электроинструменты/'
                            },
                            {
                                categorie: 'Другое',
                                url: '/рус/аксессуары/другое/'
                            }
                        ]
                    },
                    {
                        categorie: 'ЗАПЧАСТИ',
                        url: '/рус/запчасти/',
                        submenu: [
                            {
                                categorie: 'БытоваяТехника',
                                url: '/рус/запчасти/бытовая-техника/'
                            }, {
                                categorie: 'Электроинструменты',
                                url: '/рус/запчасти/электроинструменты/'
                            }, {
                                categorie: 'Мотоблоки',
                                url: '/рус/запчасти/мотоблоки/'
                            }, {
                                categorie: 'Бензоинструменты',
                                url: '/рус/запчасти/бензоинструменты/'
                            },
                            {
                                categorie: 'Другое',
                                url: '/рус/запчасти/другое/'
                            }
                        ]
                    },
                    {
                        categorie: 'ГЕНЕРАТОРЫ',
                        url: '/рус/генераторы/',
                        submenu: []
                    }
                ],
                sectionsTexts: [
                    {
                        name: 'Ассортимент со скидкой',
                        button: 'Показать больше'
                    },
                    {
                        name: 'Новый ассортимент'
                    },
                    {
                        name: 'Рекомендуем'
                    },
                    {
                        name: 'Популярные товары'
                    },
                    {
                        name: 'Популярные бренды'
                    }
                ],

                registerAndlogin: {
                    register: {
                        register: 'Регистрация',
                        email: 'Эл. почта',
                        password: 'Пароль',
                        name: 'Имя',
                        lastName: 'Фамилия',
                        phone: 'Номер телефона',
                        privacyPolicy: 'Соглашаетесь с политикой конфиденциальности?',
                        validation: {
                            email: {
                                error: 'Неправильный эл. адрес',
                                required: 'Поле Эл. почта обязательно для заполнения'
                            },
                            phoneNumber: {
                                matches: 'Номер телефона должен начинаться с + и содержать только цифры',
                                required: 'Поле Номер телефона обязательно для заполнения',
                            },
                            password: {
                                required: 'Поле Пароль обязательно для заполнения',
                                min: 'Пароль должен содержать минимум 6 символов',
                                max: 'Пароль должен содержать максимум 12 символов',
                            },
                            name: {
                                required: 'Поле Имя обязательно для заполнения',
                                min: 'Имя должен содержать максимум 4 символов',
                                max: 'Имя должен содержать максимум 12 символов',
                            },
                            lastName: {
                                required: 'Поле Фамилия обязательно для заполнения',
                                min: 'Фамилия должен содержать максимум 4 символов',
                                max: 'Фамилия должен содержать максимум 12 символов',
                            },
                            terms: {
                                required: 'Необходимо согласие',
                            }
                        }
                    },
                    login: {
                        login: 'Вход',
                        password: 'Пароль',
                        email: 'Эл. почта',
                        phone: 'Номер телефона',
                        privacyPolicy: 'Соглашаетесь с политикой конфиденциальности?',
                        registration: 'Еще не зарегестрированы?',
                        validation: {
                            email: {
                                error: 'Неправильный эл. адрес',
                                required: 'Поле Эл. почта обязательно для заполнения'
                            },
                            password: {
                                required: 'Поле пароля обязательно для заполнения',
                                min: 'Пароль должен содержать минимум 6 символов',
                                max: 'Пароль должен содержать максимум 12 символов',
                            },
                            terms: {
                                required: 'Необходимо согласие',
                            }
                        }
                    }
                }
                ,
                footer: {
                    categories: [
                        {
                            categories: 'Главная',
                        },
                        {
                            categories: 'Магазины и салоны красоты'
                        },
                        {
                            categories: 'Контакты'
                        },
                        {
                            categories: 'О нас'
                        },
                        {
                            categories: 'Правила использования'
                        },
                        {
                            categories: 'Доставка и оплата'
                        }
                    ],
                    footerContactsSections: [
                        {
                            footerContacts: 'Свяжитесь с нами'
                        },
                        {
                            address: 'Ул. Раффи дом 11, Ереван, Армения'
                        },
                        {
                            text: '31 studio © 2023 Все права защищены'
                        }

                    ]
                },
                productCard: {
                    new: 'Новинка',
                    preOrder: 'Предзаказ',
                },
                sortProducts: {
                    name: 'Сортировка по:',
                    sortProductsCategorie: [
                        'Рекомендуем',
                        'Популярности',
                        'Цене',
                        'Дате',
                        'Фильтры',
                    ]
                },
                search: {
                    search: 'Поиск',
                    results: 'Результаты',
                    products: 'Продукты'
                }
            },



            arm: {
                languages: '/հայ/',
                menu: [
                    {
                        categorie: 'ԳԼԽԱՎՈՐ',
                        url: '/հայ/',
                        submenu: []
                    },
                    {
                        categorie: 'ՆՈՐ',
                        url: '/հայ/նոր/',
                        submenu: []
                    },
                    {
                        categorie: 'ԶԵՂՉ',
                        url: '/հայ/զեղչ/',
                        submenu: []
                    },
                    {
                        categorie: 'ԳՈՐԾԻՔՆԵՐ',
                        url: '/հայ/գործիքներ/',
                        submenu: [
                            {
                                categorie: 'Էլեկտրական Գործիքներ',
                                url: '/հայ/գործիքներ/էլեկտրական-գործիքներ/'
                            },
                            {
                                categorie: 'Զոդող Սարքեր',
                                url: '/հայ/գործիքներ/զոդող-սարքեր/'
                            },
                            {
                                categorie: 'Փայտամշակման Հաստոցներ',
                                url: '/հայ/գործիքներ/փայտամշակման-հաստոցներ/'
                            },
                            {
                                categorie: 'Օդաճնշական Գործիքներ',
                                url: '/հայ/գործիքներ/օդաճնշական-գործիքներ/'
                            },
                            {
                                categorie: 'Քարի Վերամշակման Հաստոցներ',
                                url: '/հայ/գործիքներ/քարի-վերամշակման-հաստոցներ/'
                            },
                            {
                                categorie: 'Այլ',
                                url: '/հայ/գործիքներ/այլ/'
                            },

                        ]
                    },
                    {
                        categorie: 'ԳՅՈՒՂԱՏՆՏԵՍԱԿԱՆ ԳՈՐԾԻՔՆԵՐ',
                        url: '/հայ/գյուղատնտեսական-գործիքներ/',
                        submenu: [
                            {
                                categorie: 'Մոտոբլոկներ',
                                url: '/հայ/գյուղատնտեսական-գործիքներ/մոտոբլոկներ/'
                            },
                            {
                                categorie: 'Կթիչ Սարքեր',
                                url: '/հայ/գյուղատնտեսական-գործիքներ/կթիչ-սարքեր/'
                            },
                            {
                                categorie: 'Խոտհնձիչներ',
                                url: '/հայ/գյուղատնտեսական-գործիքներ/խոտհնձիչներ/'
                            },
                            {
                                categorie: 'Բենզինային Սղոցներ',
                                url: '/հայ/գյուղատնտեսական-գործիքներ/բենզինային-սղոցներ/'
                            },
                            {
                                categorie: 'Սրսկիչներ',
                                url: '/հայ/գյուղատնտեսական-գործիքներ/սրսկիչներ/'
                            },
                            {
                                categorie: 'Այլ',
                                url: '/հայ/գյուղատնտեսական-գործիքներ/այլ/'
                            },
                        ]
                    },
                    {
                        categorie: 'ԱՔՍԵՍՈՒԱՐՆԵՐ',
                        url: '/հայ/աքսեսուարներ/',
                        submenu: [
                            {
                                categorie: 'Գործիքներ',
                                url: '/հայ/աքսեսուարներ/գործիքներ/'
                            },
                            {
                                categorie: 'Էլեկտրական Գործիքներ',
                                url: '/հայ/աքսեսուարներ/էլեկտրական-գործիքներ/'
                            },
                            {
                                categorie: 'Այլ',
                                url: '/հայ/աքսեսուարներ/այլ/'
                            },
                        ]
                    },
                    {
                        categorie: 'ՊԱՀԵՍՏԱՄԱՍԵՐ',
                        url: '/հայ/պահեստամասեր/',
                        submenu: [
                            {
                                categorie: 'Կենցաղային Տեխնիկա',
                                url: '/հայ/ՊԱՀԵՍՏԱՄԱՍԵՐ/կենցաղային-տեխնիկա/'
                            },
                            {
                                categorie: 'Էլեկտրական Գործիքներ',
                                url: '/հայ/պահեստամասեր/էլեկտրական-գործիքներ/'
                            },
                            {
                                categorie: 'Մոտոբլոկներ',
                                url: '/հայ/պահեստամասեր/մոտոբլոկներ/'
                            },
                            {
                                categorie: 'Բենզինային Գործիքներ',
                                url: '/հայ/պահեստամասեր/բենզինային-գործիքներ/'
                            },
                            {
                                categorie: 'Այլ',
                                url: '/հայ/պահեստամասեր/այլ/'
                            },
                        ]
                    },
                    {
                        categorie: 'ԳԵՆԵՐԱՏՈՐՆԵՐ',
                        url: '/հայ/գեներատորներ/',
                        submenu: []
                    }
                ],
                sectionsTexts: [
                    {
                        name: 'Զեղչված տեսականի',
                        button: 'Ցույց տալ ավելին'
                    },
                    {
                        name: 'Նոր տեսականի',
                        button: 'Ցույց տալ ավելին'
                    },
                    {
                        name: 'Խորհուրդ է տրվում'
                    },
                    {
                        name: 'Շատ վաճառվող ապրանքներ'
                    },
                    {
                        name: 'Հանրաճանաչ ապրանքանիշեր'
                    }
                ],
                registerAndlogin: {
                    register: {
                        register: 'Գրանցում',
                        email: 'Էլ հասցե',
                        password: 'Գաղտնաբառ',
                        name: 'Անուն',
                        lastName: 'Ազգանուն',
                        phone: 'հեռախոսահամար',
                        privacyPolicy: 'Համաձայն եք Գաղտնիության քաղաքականությանը?',
                        validation: {
                            email: {
                                error: 'Սխալ էլ. հասցե',
                                required: 'Էլ. հասցե դաշտը պարտադիր է լրացման համար'
                            },
                            phoneNumber: {
                                matches: 'հեռախոսահամարը պետք է սկսվի + -ով և պարունակի միայն թվեր',
                                required: 'Հեռախոսահամար դաշտը պարտադիր է լրացման համար',
                            },
                            password: {
                                required: 'Գաղտնաբառ դաշտը պարտադիր է լրացման համար',
                                min: 'Գաղտնաբառը պետք է պարունակի առնվազն 6 նիշ',
                                max: 'Գաղտնաբառը պետք է պարունակի առավելագույնը 12 նիշ',
                            },
                            name: {
                                required: 'Անուն դաշտը պարտադիր է լրացման համար',
                                min: 'Անունը պետք է պարունակի առավելագույնը 4 նիշ',
                                max: 'Անունը պետք է պարունակի առավելագույնը 12 նիշ',
                            },
                            lastName: {
                                required: 'Ազգանուն դաշտը պարտադիր է լրացման համար',
                                min: 'Ազգանունը պետք է պարունակի առավելագույնը 4 նիշ',
                                max: 'Ազգանունը պետք է պարունակի առավելագույնը 12 նիշ',
                            },
                            terms: {
                                required: 'Անհրաժեշտ է համաձայնություն',
                            }
                        }
                    },
                    login: {
                        login: 'Մուտք',
                        email: 'Էլ հասցե',
                        password: 'Գաղտնաբառ',
                        phone: 'հեռախոսահամար',
                        registration: 'Դեռ գրանցված չե՞ք։',
                        privacyPolicy: 'Համաձայն եք Գաղտնիության քաղաքականությանը?',
                        validation: {
                            email: {
                                error: 'Սխալ էլ. հասցե',
                                required: 'Էլ. հասցե դաշտը պարտադիր է լրացման համար'
                            },
                            password: {
                                required: 'Գաղտնաբառ դաշտը պարտադիր է լրացման համար',
                                min: 'Գաղտնաբառը պետք է պարունակի առնվազն 6 նիշ',
                                max: 'Գաղտնաբառը պետք է պարունակի առավելագույնը 12 նիշ',
                            },
                            terms: {
                                required: 'Անհրաժեշտ է համաձայնություն',
                            }
                        }
                    }
                },
                footer: {
                    categories: [
                        {
                            categories: 'Գլխավոր',
                        },
                        {
                            categories: 'Խանութներ և գեղեցկության սրահներ'
                        },
                        {
                            categories: 'Կապվեք մեզ հետ'
                        },
                        {
                            categories: 'Մեր մասին'
                        },
                        {
                            categories: 'Օգտվելու կանոններ'
                        },
                        {
                            categories: 'Առաքում և վճարում'
                        }
                    ],
                    footerContactsSections: [
                        {
                            footerContacts: 'Կապ հաստատեք մեզ հետ'
                        },
                        {
                            address: '11 Րաֆֆի փ., Երևան, հայաստան'
                        },
                        {
                            text: '31 studio © 2023 Բոլոր իրավունքները պաշտպանված են'
                        }

                    ]
                },
                productCard: {
                    new: 'Նոր',
                    preOrder: 'Նախնական պատվեր',
                },
                sortProducts: {
                    name: 'Դասավորել ըստ:',
                    sortProductsCategorie: [
                        'Թոփ առաջարկների',
                        'Հայտնիության',
                        'Գնի',
                        'Ավելացման Ժամանակի',
                        'Ֆիլտրներ',
                    ]
                },
                search: {
                    search: 'Որոնում',
                    results: 'Արդյունքներ',
                    products: 'Ապրանքներ'
                }

            }
        },

        shopAdvertisementSlider: [
            {
                textTop: {
                    arm: 'ԳՈՐԾՈՒՄ Է ԱՊԱՌԻԿ ՎԱՃԱՌՔ',
                    rus: 'ПРОДАЖА В КРЕДИТ'
                },
                textBottom: {
                    arm: '',
                    rus: ''
                },
                img: shopAdvertisementSliderImage1
            },
            {
                textTop: {
                    arm: 'ՊՐՈՖԵՍԻՈՆԱԼ ԵՌԱԿՑՄԱՆ ՍԱՐՔԵՐԻ ԵՎ ՊԼԱԶՄԱՅԻՆ ՀԱՏԻՉՆԵՐԻ ԼԱՅՆ ԸՆՏՐԱՆԻ',
                    rus: 'ШИРОКИЙ ВЫБОР ПРОФЕССИОНАЛЬНОГО СВАРОЧНОГО ОБОРУДОВАНИЯ И ПЛАЗМЕННОЙ РЕЗКИ'
                },
                textBottom: {
                    arm: 'MIG, MAG, MMA, TIG, PLASMA, AC/DC',
                    rus: 'MIG, MAG, MMA, TIG, PLASMA, AC/DC'

                },
                img: shopAdvertisementSliderImage3
            },
            {
                textTop: {
                    arm: 'ԱՅԳԵԳՈՐԾԱԿԱՆ ԳՈՐԾԻՔՆԵՐԻ ԵՎ ՍԱՐՔԱՎՈՐՈՒՄՆԵՐԻ ԼԱՅՆ ԸՆՏՐԱՆԻ',
                    rus: 'ШИРОКИЙ ВЫБОР САДОВЫХ ИНСТРУМЕНТОВ И ОБОРУДОВАНИЯ'
                },
                textBottom: {
                    arm: 'ԳՈՐԾՈՒՄ Է ՄԱՆՐԱՄԵԾԱԾԱԽ ՎԱՃԱՌՔ',
                    rus: 'ДЕЙСТВУЕТ ОПТОВО-РОЗНИЧНАЯ ПРОДАЖА'
                },
                img: shopAdvertisementSliderImage2
            },
            {
                textTop: {
                    arm: 'ՇԻՆԱՐԱՐԱԿԱՆ ԳՈՐԾԻՔՆԵՐԻ ԵՎ ՍԱՐՔԱՎՈՐՈՒՄՆԵՐԻ ԼԱՅՆ ԸՆՏՐԱՆԻ',
                    rus: 'ШИРОКИЙ ВЫБОР СТРОИТЕЛЬНЫХ ИНСТРУМЕНТОВ И ОБОРУДОВАНИЯ'
                },
                textBottom: {
                    arm: 'ԳՈՐԾՈՒՄ Է ՄԱՆՐԱՄԵԾԱԾԱԽ ՎԱՃԱՌՔ',
                    rus: 'ДЕЙСТВУЕТ ОПТОВО-РОЗНИЧНАЯ ПРОДАЖА'
                },
                img: shopAdvertisementSliderImage4
            },
        ],

        products: [
            {
                id: 'product1',
                name: 'Угловая шлифовальная машина FLEX L 15-11',
                img: img5,
                sale: '30',
                description: 'Угловая шлифовальная машина FLEX L 15-11 125 230/СЕЕ арт.447692 предназначена для обработки металлических и стальных поверхностей в строительстве и ремонте, в кузовостроении, а также при выполнении работ в монтажных мастерских.',
                characteristic: 'Напряжение 220 В ,Мощность 1500 Вт, Диаметр диска 125 мм, Посадочный диаметр 22.2 мм',
                salePrice: 13002,
                price: 25000,
                recommended: true,
                news: true,
                categorie: {
                    arm: 'ԳՈՐԾԻՔՆԵՐ',
                    rus: 'ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Էլեկտրական Գործիքներ',
                        rus: 'Электроинструменты'
                    }
                }
            },
            {
                id: 'product2',
                name: 'Сварочный инвертор Gigant MMA MINI GOS-160',
                img: img15,
                sale: '77',
                description: 'Сварочный инвертор Gigant MMA MINI GOS-160 представляет собой мобильное оборудование, которое служит для соединения покрытыми штучными электродами деталей стальных металлоконструкций. Прочный корпус защищает внутренние элементы от повреждений при случайных механических воздействиях. Разъемы обеспечивают возможность легко и быстрого подключить кабели без использования каких-либо инструментов. Модель отличается простотой управления и не требует сложного технического обслуживания.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: 100882,
                price: 295000,
                recommended: false,
                news: true,
                categorie: {
                    arm: 'ԳՈՐԾԻՔՆԵՐ',
                    rus: 'ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Զոդող Սարքեր',
                        rus: 'Сварочныйе Аппараты'
                    }
                }
            },
            {
                id: 'product3',
                name: 'HANDTEK Цепная пила аккумуляторная для сада и дачи 21в 2 акб',
                img: img10,
                sale: 33,
                description: 'Ручная цепная электропила Handtek ES 1810 L2 - это профессиональный, надежный и долговечный электроинструмент для ремонта дома, сада и дачи. В отличие от проводной сетевой электро пилы, аккумуляторный инструмент обладает повышенной мобильностью.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: 3121,
                price: 24000,
                recommended: false,
                news: true,
                categorie: {
                    arm: 'ԳՈՐԾԻՔՆԵՐ',
                    rus: 'ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Փայտամշակման Հաստոցներ',
                        rus: 'Деревообрабатывающие Станки'
                    }
                }
            },
            {
                id: 'product4',
                name: 'Пневматический инструмент Sturm AU-1730-04',
                img: img17,
                sale: '',
                description: 'Пневматический инструмент Sturm AU-1730-04 – инструмент, который работает на энергии сжатого воздуха. Универсальный степлер работает как со скобами так и с гвоздями.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: '',
                price: 61000,
                news: true,
                recommended: true,
                categorie: {
                    arm: 'ԳՈՐԾԻՔՆԵՐ',
                    rus: 'ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Օդաճնշական Գործիքներ',
                        rus: 'Пневматические Инструменты'
                    }
                }
            },
            {
                id: 'product5',
                name: 'Мостовой распиловочный станок HQDQ-1600 Tech-Nick',
                img: img12,
                sale: '10',
                description: 'HQDQ-1600 Tech-Nick - относится к категории среднего мостового распиловочного оборудования. Предназначен для распиловки небольших полу-блоков. Также, как и форматно-раскроечные станки, HQDQ-1600 широко распространен на производственных мощностях большинства камнеобрабатывающих предприятий, особенно в Республике Карелия. Станок максимально адаптирован к работе в сложных условиях эксплуатации. Высокая производительность данного оборудования подтверждена всеми без исключения партнерами, установившими у себя данный тип станка. По своим скоростным характеристикам данный станок превосходит аналоги как китайских, так и ведущих европейских производителей.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: 13122,
                price: 151000,
                recommended: false,
                news: true,
                categorie: {
                    arm: 'ԳՈՐԾԻՔՆԵՐ',
                    rus: 'ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Քարի Վերամշակման Հաստոցներ',
                        rus: 'Камнеобрабатывающие Станки'
                    }
                }
            },
            {
                id: 'product6',
                name: 'Электрическая тележка TOR PPT20H Li-ion 2000 кг, 1150 мм 1022429',
                img: img13,
                sale: '',
                description: 'Электрическая тележка TOR PPT20H Li-ion 2000 кг, 1150 мм 1022429 предназначена для использования на складских и производственных объектах. Мощная батарея обеспечивает длительное использование.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: '',
                price: 161000,
                recommended: false,
                news: true,
                categorie: {
                    arm: 'ԳՈՐԾԻՔՆԵՐ',
                    rus: 'ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Այլ',
                        rus: 'Другое'
                    }
                }
            },
            {
                id: 'product7',
                name: 'Мотоблок бензиновый GT-300, 212 см3 STEHER',
                img: img19,
                sale: '20',
                description: 'Мотоблок STEHER GT-300, предназначен для рыхления и культивации почвы на приусадебном участке. Эффективный двигатель с воздушным фильтром в масляной ванне увеличивает моторесурс. Складываемые, регулируемые по положению рукоятки и транспортное колесо облегчают эксплуатацию, транспортировку и хранение.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: 55000,
                price: 1655000,
                recommended: true,
                news: true,
                categorie: {
                    arm: 'ԳՅՈՒՂԱՏՆՏԵՍԱԿԱՆ ԳՈՐԾԻՔՆԵՐ',
                    rus: 'СЕЛЬСКОХОЗЯЙСТВЕННЫЕ ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Մոտոբլոկներ',
                        rus: 'Мотоблоки'
                    }
                }
            },
            {

                id: 'product8',
                name: 'Доильная аппаратура Фермер ДА ЦР',
                img: img9,
                sale: '26',
                description: 'Доильная аппаратура "Фермер" ДА ЦР предназначена для комплектации доильных аппаратов АДЭ "Фермер" с целью машинной дойки коров в небольших коллективных и частных хозяйствах. Работа доильного аппарата в режиме доения основана на принципе отсоса молока из вымени коровы под действием вакуума, создаваемого вакуумным насосом. Молоко из доильного аппарата поступает в бидон по молокопроводу. Доильный аппарат работает по двухтактному принципу. В комплектацию ДА входит следующее навесное оборудование:',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: 55000,
                price: 1155000,
                recommended: true,
                news: false,
                categorie: {
                    arm: 'ԳՅՈՒՂԱՏՆՏԵՍԱԿԱՆ ԳՈՐԾԻՔՆԵՐ',
                    rus: 'СЕЛЬСКОХОЗЯЙСТВЕННЫЕ ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Կթիչ Սարքեր',
                        rus: 'Доильные аппараты'
                    }
                }
            },
            {
                id: 'product9',
                name: 'Триммер бензиновый БУЛАТ БТ 52, 2,9 л.с., 52 см3',
                img: img18,
                sale: '',
                description: 'Кожух, трехлопастной нож, канистра для топливной смеси, набор инструментов, штанга, наплечевой ремень, шпуля.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: '',
                price: 55000,
                recommended: false,
                news: true,
                categorie: {
                    arm: 'ԳՅՈՒՂԱՏՆՏԵՍԱԿԱՆ ԳՈՐԾԻՔՆԵՐ',
                    rus: 'СЕЛЬСКОХОЗЯЙСТВЕННЫЕ ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Խոտհնձիչներ',
                        rus: 'Триммеры'
                    }
                }
            },
            {
                id: 'product10',
                name: 'Бензопила цепная бензиновая MAXCUT MC 146 Shark пила ручная садовая 2.9лс, шина 15", 64 звена',
                img: img4,
                sale: '',
                description: 'Мощная и надежная бензопила MC 146 Shark предназначена для строительства, заготовки дров, использования на садовом участке и в ландшафтном дизайне. Используется для валки деревьев диаметром до 40 сантиметров. Надежный 2Т двигатель с увеличенным моторесурсом, передовая антивибрационная система, сбалансированная конструкция обеспечат удобство при эксплуатации и точный распил. Легкий доступ к воздушному фильтру и свече позволяет проводить регулярное техническое обслуживание без необходимости обращения в сервисный центр. Пила оборудована автоматической системой смазки цепи, которая не даст перегреться рабочим частям пилы, и предохранит их от преждевременного износа и коррозии. Кроме того, система смазки имеет возможность регулировки количества подаваемого масла на цепь в зависимости от условий работы и типа древесины.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: '',
                price: 50000,
                recommended: true,
                news: false,
                categorie: {
                    arm: 'ԳՅՈՒՂԱՏՆՏԵՍԱԿԱՆ ԳՈՐԾԻՔՆԵՐ',
                    rus: 'СЕЛЬСКОХОЗЯЙСТВЕННЫЕ ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Բենզինային Սղոցներ',
                        rus: 'Бензопилы'
                    }
                }
            },
            {
                id: 'product11',
                name: 'Опрыскиватель Polyagro пневматический ручной 2,0л',
                img: img14,
                sale: '',
                description: 'Опрыскиватель пневматический бытовой.Предназначен для обработки домашних и садовых растений, увлажнения воздуха, обработки и увлажнения различных поверхностей при строительстве, обслуживании техники и др. ',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: '',
                price: 20000,
                recommended: false,
                news: true,
                categorie: {
                    arm: 'ԳՅՈՒՂԱՏՆՏԵՍԱԿԱՆ ԳՈՐԾԻՔՆԵՐ',
                    rus: 'СЕЛЬСКОХОЗЯЙСТВЕННЫЕ ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Սրսկիչներ',
                        rus: 'Опрыскиватели'
                    }
                }
            },
            {
                id: 'product12',
                name: 'Переносной выдуватель воздуха для листьев GP-LB 18/200 Li E-Solo',
                img: img11,
                sale: '',
                description: 'Аккумуляторный воздуходув для листьев Einhell GP-LB 18/200 Li E Solo - это проверенный помощник по дому, особенно во время осенней и весенней уборки. Являясь членом семейства Power-X-Change, аккумуляторная воздуходувка для листьев может использоваться вместе со всеми аккумуляторными батареями серии System. Для работы необходим один аккумулятор 18 В. Данный продукт поставляется без аккумулятора и зарядного устройства; эти предметы можно приобрести отдельно, например, в качестве практичного стартового набора.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: '',
                price: 25000,
                recommended: false,
                news: false,
                categorie: {
                    arm: 'ԳՅՈՒՂԱՏՆՏԵՍԱԿԱՆ ԳՈՐԾԻՔՆԵՐ',
                    rus: 'СЕЛЬСКОХОЗЯЙСТВЕННЫЕ ИНСТРУМЕНТЫ',
                    subcategorie: {
                        arm: 'Այլ',
                        rus: 'Другое'
                    }
                }
            },
            {
                id: 'product13',
                name: 'Набор инструментов для дома DEKO TZ100 ',
                img: img7,
                sale: '',
                description: 'Набор инструментов для дома DEKO TZ100 (100 предметов) имеет высокое качество и изготовлен из высококачественной стали с высокополированной хромированной и антикоррозийной защитой. Набор также содержит инструменты, необходимые для большинства небольших ремонтов и основных проектов по всему дому. Все части этого набора надежно помещаются в прочный корпус для легкой переноски и удобного использования.',
                characteristic: 'Напряжение 220 В ,Max мощность 3.8 кВт ,Min ток 20 А',
                salePrice: '',
                price: 20000,
                recommended: true,
                news: false,
                categorie: {
                    arm: 'ԱՔՍԵՍՈՒԱՐՆԵՐ',
                    rus: 'АКСЕССУАРЫ',
                    subcategorie: {
                        arm: 'Գործիքներ',
                        rus: 'Инструменты'
                    }
                }
            },
            {
                id: 'product14',
                name: 'пистолет для монтажной пены',
                img: img20,
                sale: '',
                description: 'Пистолет для монтажной пены предназначен для нанесения строительной пены в подготовленную полость. Возможность регулировки подачи строительного материала.',
                characteristic: '',
                salePrice: '',
                price: 5000,
                recommended: false,
                news: false,
                categorie: {
                    arm: 'ԱՔՍԵՍՈՒԱՐՆԵՐ',
                    rus: 'АКСЕССУАРЫ',
                    subcategorie: {
                        arm: 'Էլեկտրական Գործիքներ',
                        rus: 'Электроинструменты'
                    }
                }
            },
            {
                id: 'product15',
                name: 'Щетки угольные для перфораторов МАКИТА HR2450',
                img: img6,
                sale: '',
                description: 'Щетки угольные МАКИТА 6х9х12 (Makita 191962-4 СВ-419А) 602 AEZ Угольные щетки CB-419 Makitа (Макита) подходят для моделей 4304,4304T, 4305, 4305T, 4340CT, 4340FCT, 4340T, 4341CT, 4341FCT, 4341T, 4350CT, 4350FCT, 4351CT, 4351FCT, 6310, 6408, 6807, 6821, 6823,6824N, 6825, 6826, 6826N, 6827, 800, 8450, 8451, 9046, 910, BO4555, BO4556, BO4557, BO4565, BO4566, BO4900, BO4901, B05000, BO5001, BO5030, BO5031, BO6030, DA3010, DA3010F, DA3011, DA3011F, DP3003, DP4001, DP4003, DP4010, DP4011, FS2300, FS2500, FS2700, FS4000, FS4200, FS4300, FS6300, FS6300R, HP1500, HP1501, HP1620, HP1620F, HP1621, HP1621F, HP1640, HP1641, HP1641F, HP2030, HP2031, HP2032, HP2033, HP2040, HP2041, HP2050, HP2050F, HP2051, HP2051F, HP2070, HP2070F, HP2071, HP2071F, HR1830, HR1830F, HR2020, HR240, HR2430, HR2431, HR2432, HR2440, HR2440F, HR2450, HR2450F, HR2450FT, HR2450, HT-355, HT-48, HT49, HT5510, JR1000FT, JS1300, MT924, UH4260, UH4261, UH4570, UH4860, UH4861, UH5260, UH5261, UH5570, UH5580, UH6570, UH6580, UH7580 и др.',
                characteristic: 'Угольные щетки для электроинструмента',
                salePrice: '',
                price: 2000,
                recommended: true,
                news: false,
                categorie: {
                    arm: 'ԱՔՍԵՍՈՒԱՐՆԵՐ',
                    rus: 'АКСЕССУАРЫ',
                    subcategorie: {
                        arm: 'Այլ',
                        rus: 'Другое'
                    }
                }
            },
            {
                id: 'product16',
                name: 'ТЭН для электроплит Мечта / Злата / электронагреватель',
                img: img3,
                sale: '',
                description: 'ТЭН для электроплит "Мечта" г.Златоуст выступает в роли нагревателя, представляет собой металлическую трубку, заполненную теплопроводящим электрическим изолятором. ',
                characteristic: 'Запчасть для плиты',
                salePrice: '',
                price: 1000,
                recommended: false,
                news: true,
                categorie: {
                    arm: 'ՊԱՀԵՍՏԱՄԱՍԵՐ',
                    rus: 'ЗАПЧАСТИ',
                    subcategorie: {
                        arm: 'Կենցաղային Տեխնիկա',
                        rus: 'Бытовая Техника'
                    }
                }
            },
            {
                id: 'product17',
                name: 'Кнопка для шуруповерта и дрели ЗУБР 181КН Интерскол DEKO Калибр Зенит METABO MAKITA Вихрь Ермак OAZIZ BOSCH LongYun',
                img: img8,
                sale: '',
                description: 'Выключатель для электроинструмента',
                characteristic: 'Совместимый инструмент Дрель, Отвертка, Шуруповерт',
                salePrice: '',
                price: 5000,
                recommended: false,
                news: true,
                categorie: {
                    arm: 'ՊԱՀԵՍՏԱՄԱՍԵՐ',
                    rus: 'ЗАПЧАСТИ',
                    subcategorie: {
                        arm: 'Էլեկտրական Գործիքներ',
                        rus: 'Электроинструменты'
                    }
                }
            },
            {
                id: 'product18',
                name: 'Воздушный фильтр элемент для мотокультиватора, виброплиты',
                img: img16,
                sale: '',
                description: 'Элемент воздушного фильтра 4-х тактного двигателя Honda GX160 / GX200 Brait, Carver, Парма, Texas Lifan Forza Loncin 168F, 170F',
                characteristic: 'Фильтр воздушный для бензоинструмента',
                salePrice: '',
                price: 7000,
                recommended: true,
                news: false,
                categorie: {
                    arm: 'ՊԱՀԵՍՏԱՄԱՍԵՐ',
                    rus: 'ЗАПЧАСТИ',
                    subcategorie: {
                        arm: 'Մոտոբլոկներ',
                        rus: 'Мотоблоки'
                    }
                }
            },
            {
                id: 'product19',
                name: 'Фильтр топливный маленький',
                img: img2,
                sale: '',
                description: 'Фильтр топливный маленький (2 штуки) для бензопилы / триммера / мотокосы / бензокосы',
                characteristic: 'Запчасть для бензоинструмента',
                salePrice: '',
                price: 500,
                recommended: false,
                news: false,
                categorie: {
                    arm: 'ՊԱՀԵՍՏԱՄԱՍԵՐ',
                    rus: 'ЗАПЧАСТИ',
                    subcategorie: {
                        arm: 'Բենզինային Գործիքներ',
                        rus: 'Бензоинструменты'
                    }
                }
            },
            {
                id: 'product20',
                name: 'Кронштейн крепления ручки газа бензокосы штанга',
                img: img1,
                sale: '',
                description: 'КРОНШТЕЙН КРЕПЛЕНИЯ РУЧКИ ГАЗА БЕНЗОКОСЫ ШТАНГА 26 ММ',
                characteristic: 'Запчасть для бензоинструмента',
                salePrice: '',
                price: 1000,
                recommended: false,
                news: false,
                categorie: {
                    arm: 'ՊԱՀԵՍՏԱՄԱՍԵՐ',
                    rus: 'ЗАПЧАСТИ',
                    subcategorie: {
                        arm: 'Այլ',
                        rus: 'Другое'
                    }
                }
            },
            {
                id: 'product21',
                name: 'Бензиновый генератор ALTECO SPG 3700 ',
                img: img21,
                sale: '',
                description: 'Бензиновый генератор ALTECO SPG 3700 (N) Stalker, арт. 27184 - предназначен для использования, в качестве аварийного источника электроснабжения. Всегда обязательно учитывайте суммарную мощность всех подключаемых приборов с учетом коэффициентов пусковых токов для каждого прибора. Не подключайте два, или более генераторов, параллельно.',
                characteristic: 'Класс товара - бытовой',
                salePrice: '',
                price: 70000,
                recommended: false,
                news: false,
                categorie: {
                    arm: 'ԳԵՆԵՐԱՏՈՐՆԵՐ',
                    rus: 'ГЕНЕРАТОРЫ'
                }
            },
        ]
    }
    return { data }
}

export default data